---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InitialViewDeleted
source: html/039eda3a-3b09-3952-ffcc-9b5dde082931.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.InitialViewDeleted Property

The starting view for the project has been deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId InitialViewDeleted { get; }
```